EDT/УТ/src/Reports/ММ_РасшифровкаБанковскихПереводов/ММ_РасшифровкаБанковскихПереводов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ММ_РасшифровкаБанковскихПереводов</name>
</mdclass:Report>

EDT/УТ/src/AccumulationRegisters/ЗакрытыеЗаказы/ЗакрытыеЗаказы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЗакрытыеЗаказы</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>СуммаОценочная</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаПолученная</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаДоставкиДоМКАД</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаДоставкиЗаМКАД</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>УслугиСД</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>БанковскаяКомиссия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КассовоеОбслуживание</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаВозврата</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Масса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаЧастичногоВозврата</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОплаченоКлиентовНал</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>АгентскоеВознаграждение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПредоплатаПоКредиту</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>УслугиСДЧистые</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтраховойСбор</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ФактическийВес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОбъемЗабора</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОбъемЗабораПоЗаказам</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВыгруженныйОбъем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТарифицируемыйВес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтоимостьОценочнаяПоТоварно</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоПереносовСЗаездами</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтоимостьПереносовСЗаездами</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтоимостьПодъемаМП</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоТарифицируемыхРейсов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВознаграждениеАгентаПоПредоплаченнымЗаказам</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ФрахтЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТарифицируемыйОбъемныйВес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Поступление</name>
    <type>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>Списание</name>
    <type>
      <types>DocumentRef.СписаниеТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>Оприходование</name>
    <type>
      <types>DocumentRef.ОприходованиеТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>Перемещение</name>
    <type>
      <types>DocumentRef.ПеремещениеТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>Доставка</name>
    <type>
      <types>BusinessProcessRef.новаМестнаяДоставка</types>
    </type>
  </attributes>
  <attributes>
    <name>Возврат</name>
    <type>
      <types>DocumentRef.ВозвратТоваровОтПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>ПризнакВозврата</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОценочнаяСтоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Корректировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТарификацияПоОбъемномуВесу</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>ЮрЛицо</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипЗаказа</name>
    <type>
      <types>EnumRef.ТипыЗаказов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Транспорт</name>
    <type>
      <types>CatalogRef.новаТранспорт</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИнтернетМагазин</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КатегорияДоставки</name>
    <type>
      <types>CatalogRef.КатегорииДоставки2014</types>
      <types>CatalogRef.КатегорииДоставки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.новаВодители</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Экспедитор</name>
    <type>
      <types>CatalogRef.новаЭкспедиторы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Реализация</name>
    <type>
      <types>DocumentRef.ЗаборТовара</types>
      <types>DocumentRef.Фрахт</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипОплаты</name>
    <type>
      <types>CatalogRef.ТипыОплат</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатусЗаказа</name>
    <type>
      <types>CatalogRef.новаРезультатМестнойДоставки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПричинаНевыполнения</name>
    <type>
      <types>CatalogRef.ПричиныНеВыполненияДоставки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатусИнтернетМагазина</name>
    <type>
      <types>CatalogRef.СтатусЗаказаИнтернетМагазина</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПричинаОтказа</name>
    <type>
      <types>CatalogRef.ПричиныОтказаПереноса</types>
    </type>
  </dimensions>
  <dimensions>
    <name>VIPДоставка</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидVip</name>
    <type>
      <types>CatalogRef.ВидыVip</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТарифнаяСетка</name>
    <type>
      <types>CatalogRef.ТипыТарифов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РасчетныйБрейк</name>
    <type>
      <types>CatalogRef.РасчетныеБрейки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТарифнаяСеткаПартнера</name>
    <type>
      <types>CatalogRef.ТарифныеСетки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗонаТарификации</name>
    <type>
      <types>CatalogRef.ГруппыРайонов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПричинаОтклоненияЗаказа</name>
    <comment>Причина отклонения заказа в системе</comment>
    <type>
      <types>CatalogRef.ПричиныОтклоненияЗаказаВСистеме</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТерминалДоставки</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТерминалПриёма</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъемныйБрейк</name>
    <type>
      <types>CatalogRef.ОбъемныеБрейки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПодъемныйБрейк</name>
    <type>
      <types>CatalogRef.ВесовыеБрейкиРасчетаСтоимостиПодъемов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

EDT/УТ/src/Enums/ТипыЗаказов/ТипыЗаказов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыЗаказов</name>
  <enumValues>
    <name>Доставка</name>
  </enumValues>
  <enumValues>
    <name>Самовывоз</name>
  </enumValues>
  <enumValues>
    <name>Забор</name>
  </enumValues>
  <enumValues>
    <name>Фрахт</name>
  </enumValues>
  <enumValues>
    <name>Возврат</name>
  </enumValues>
  <enumValues>
    <name>Обмен</name>
  </enumValues>
</mdclass:Enum>

EDT/УТ/src/Enums/ВариантОплатыКомитентам/ВариантОплатыКомитентам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВариантОплатыКомитентам</name>
  <enumValues>
    <name>СуммаПолностью</name>
  </enumValues>
  <enumValues>
    <name>ЗаВычетомНашихУслуг</name>
  </enumValues>
</mdclass:Enum>

EDT/УТ/src/Catalogs/ТипыОплат/ТипыОплат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТипыОплат</name>
  <predefined>
    <items>
      <name>БезРасчетов</name>
      <description>Без расчетов</description>
    </items>
    <items>
      <name>БезналичныйРасчет</name>
      <description>Безналичный расчет</description>
    </items>
    <items>
      <name>ВКредит</name>
      <description>В кредит</description>
    </items>
    <items>
      <name>Наличные</name>
      <description>Наличные</description>
    </items>
    <items>
      <name>ОплатаDPD</name>
      <description>Оплата DPD</description>
    </items>
    <items>
      <name>ОплатаКартой</name>
      <description>Оплата картой</description>
    </items>
    <items>
      <name>ОплаченоВМагазине</name>
      <description>Оплачено в магазине</description>
    </items>
    <items>
      <name>СБП</name>
      <description>СБП</description>
    </items>
    <items>
      <name>Терминал</name>
      <description>Терминал</description>
    </items>
    <items>
      <name>ЯндексДеньги</name>
      <description>Яндекс Деньги</description>
    </items>
  </predefined>
  <attributes>
    <name>КодОплаты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СекцияТоваров</name>
    <type>
      <types>CatalogRef.СекцияККМ</types>
    </type>
  </attributes>
  <attributes>
    <name>СекцияУслуг</name>
    <type>
      <types>CatalogRef.СекцияККМ</types>
    </type>
  </attributes>
  <attributes>
    <name>БезналичнаяОплата</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СекцияТоваровНДС</name>
    <type>
      <types>CatalogRef.СекцияККМ</types>
    </type>
  </attributes>
  <attributes>
    <name>КодОплатыНаККМ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

EDT/УТ/src/Catalogs/новаРезультатМестнойДоставки/новаРезультатМестнойДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>новаРезультатМестнойДоставки</name>
  <predefined>
    <items>
      <name>Выполнена</name>
      <description>Выполнена</description>
    </items>
    <items>
      <name>ВыполненаЧастично</name>
      <description>Выполнена частично</description>
    </items>
    <items>
      <name>НеВыполнена</name>
      <description>Не выполнена</description>
    </items>
  </predefined>
  <attributes>
    <name>РезультатВыполнения</name>
    <type>
      <types>EnumRef.новаРезультатВыполненияМестнойДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричиныНеВыполнения</name>
    <type>
      <types>CatalogRef.новаПричиныНеВыполненияМестнойДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентОплатыВодителю</name>
    <comment>Если выполнена 100%</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаПосещена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

EDT/УТ/src/Reports/ММ_РасшифровкаБанковскихПереводов/ObjectModule.bsl
Функция Сформировать(Таб, НачПериода, КонПериода, Контрагент, Разница = 0, ТаблицаДат = Неопределено, ДатаПлатежа = Неопределено, МассивТиповОплат, Приложение6 = Ложь) Экспорт
	//+++ Костя 030915
	ЗапросПоГруппеКомпаний = Новый Запрос(
	"ВЫБРАТЬ
	|	Контрагенты.Ссылка
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|Контрагенты.ОсновнойМагазин = &ОсновнойМагазин");
	ЗапросПоГруппеКомпаний.УстановитьПараметр("ОсновнойМагазин",Контрагент);
	Выборка = ЗапросПоГруппеКомпаний.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		КонтрПоГруппе = Выборка.Ссылка;
		ПоГруппеКомпаний = ?(КонтрПоГруппе.ЭтоГруппа, Истина, Ложь);
		Если ПоГруппеКомпаний Тогда
			
			Запрос = Новый Запрос(
			"ВЫБРАТЬ
			|	Контрагенты.Ссылка
			|ИЗ
			|	Справочник.Контрагенты КАК Контрагенты
			|ГДЕ
			|	Контрагенты.Родитель = &Родитель");
			Запрос.УстановитьПараметр("Родитель", КонтрПоГруппе);
			ТЗКонтрагентов = Запрос.Выполнить().Выгрузить();
			СписокКонтрагентов = Новый СписокЗначений;
			Для Каждого Стр Из ТЗКонтрагентов Цикл
				НоваяСтр = СписокКонтрагентов.Добавить(Стр.Ссылка);				
			КонецЦикла;
			СписокКонтрагентов.Добавить(Контрагент);
		КонецЕсли;
	Иначе
		ПоГруппеКомпаний = Ложь;
	КонецЕсли;
	//--- Костя 030915
	
	Таб.Очистить();
	Зап = Новый Запрос;
	//+++ Костя 110915
	Если МассивТиповОплат.Найти(Справочники.ТипыОплат.Наличные) <> Неопределено Тогда
    	МассивТиповОплат.Добавить(Справочники.ТипыОплат.ВКредит);
	КонецЕсли;
	//--- Костя 110915
	
	Если ТаблицаДат = Неопределено Тогда
//		Зап.Текст = "ВЫБРАТЬ
//		            |	МИНИМУМ(ПлатежноеПоручениеИсходящееТаблицаДатОплат.Ссылка.Дата) КАК Дата,
//		            |	ГОД(ПлатежноеПоручениеИсходящееТаблицаДатОплат.ДатаДоставки) КАК ГодДоставки,
//		            |	МЕСЯЦ(ПлатежноеПоручениеИсходящееТаблицаДатОплат.ДатаДоставки) КАК МесяцДоставки,
//		            |	ДЕНЬ(ПлатежноеПоручениеИсходящееТаблицаДатОплат.ДатаДоставки) КАК ДеньДоставки,
//		            |	ПлатежноеПоручениеИсходящееТаблицаДатОплат.Ссылка.СуммаДокумента,
//		            |	ПлатежноеПоручениеИсходящееТаблицаДатОплат.Ссылка.НомерПлатежногоПоручения КАК НомерПП
//		            |ПОМЕСТИТЬ ВТОплаты
//		            |ИЗ
//		            |	Документ.ПлатежноеПоручениеИсходящее.ТаблицаДатОплат КАК ПлатежноеПоручениеИсходящееТаблицаДатОплат
//		            |ГДЕ
//					|	ПлатежноеПоручениеИсходящееТаблицаДатОплат.Ссылка.Проведен = ИСТИНА"
//					//+++ Костя 030915
//+?(ПоГруппеКомпаний,"	И ПлатежноеПоручениеИсходящееТаблицаДатОплат.Ссылка.Контрагент В (&СписокКонтрагентов)",
//					"	И ПлатежноеПоручениеИсходящееТаблицаДатОплат.Ссылка.Контрагент = &Контрагент")+"
//					//--- Костя 030915
//		            |	И ПлатежноеПоручениеИсходящееТаблицаДатОплат.Ссылка.Дата МЕЖДУ &НачПериода И &КонПериода
//		            |
//		            |СГРУППИРОВАТЬ ПО
//		            |	ГОД(ПлатежноеПоручениеИсходящееТаблицаДатОплат.ДатаДоставки),
//		            |	МЕСЯЦ(ПлатежноеПоручениеИсходящееТаблицаДатОплат.ДатаДоставки),
//		            |	ДЕНЬ(ПлатежноеПоручениеИсходящееТаблицаДатОплат.ДатаДоставки),
//		            |	ПлатежноеПоручениеИсходящееТаблицаДатОплат.Ссылка.СуммаДокумента,
//		            |	ПлатежноеПоручениеИсходящееТаблицаДатОплат.Ссылка.НомерПлатежногоПоручения
//		            |;
//		            |
//		            |////////////////////////////////////////////////////////////////////////////////
//		            |ВЫБРАТЬ
//		            |	ЗакрытыеЗаказы.ИнтернетМагазин,
//		            |	ЗакрытыеЗаказы.Реализация,
//		            |	ЗакрытыеЗаказы.Реализация.Номер КАК НомерЗаказа,
//		            |	ЗакрытыеЗаказы.Реализация.НомерВнешнегоЗаказа КАК НомерВнешнегоЗаказа,
//		            |	ЗакрытыеЗаказы.Период КАК ДатаДоставки,
//		            |	ЗакрытыеЗаказы.ТипЗаказа КАК ВидРабот,
//		            |	ЗакрытыеЗаказы.Доставка.ДатаСоздания КАК ДатаЗабора,
//		            |	ЗакрытыеЗаказы.СуммаОценочная КАК СтоимостьГруза,
//					|	ЗакрытыеЗаказы.СуммаОценочная.ПричинаНевыполнения КАК ПричинаНевыполнения,
//		            |	ЗакрытыеЗаказы.СуммаЧастичногоВозврата КАК СтоимостьВозврата,
//		            |	ЗакрытыеЗаказы.УслугиСД + ЗакрытыеЗаказы.БанковскаяКомиссия + ЗакрытыеЗаказы.КассовоеОбслуживание КАК АгентскоеВознаграждение,
//		            |	ВЫБОР
//		            |		КОГДА ЗакрытыеЗаказы.ТипОплаты В (&МассивТиповОплат)
//		            |			ТОГДА ЗакрытыеЗаказы.ОплаченоКлиентовНал
//		            |		ИНАЧЕ 0
//		            |	КОНЕЦ КАК СуммаПолученнаяОтПокупателей,
//		            |	ЗакрытыеЗаказы.СуммаДоставкиДоМКАД + ЗакрытыеЗаказы.СуммаДоставкиЗаМКАД КАК СтоимостьДоставки,
//		            |	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаПеречисления,
//		            |	ЗакрытыеЗаказы.СтатусЗаказа КАК СтатусДоставки,
//		            |	ГОД(ЗакрытыеЗаказы.Период) КАК ГодДоставки,
//		            |	МЕСЯЦ(ЗакрытыеЗаказы.Период) КАК МесяцДоставки,
//		            |	ДЕНЬ(ЗакрытыеЗаказы.Период) КАК ДеньДоставки
//		            |ПОМЕСТИТЬ ВТДоставки
//		            |ИЗ
//		            |	РегистрНакопления.ЗакрытыеЗаказы КАК ЗакрытыеЗаказы
//		            |ГДЕ"
//					//+++ Костя 030915
//+?(ПоГруппеКомпаний,"	ЗакрытыеЗаказы.ИнтернетМагазин В ИЕРАРХИИ(&СписокКонтрагентов)",
//					"	ЗакрытыеЗаказы.ИнтернетМагазин = &Контрагент")+"
//					//--- Костя 030915
//		            |	И ЗакрытыеЗаказы.СтатусИнтернетМагазина <> ЗНАЧЕНИЕ(Справочник.СтатусЗаказаИнтернетМагазина.ЗаказОтклонен)
//		            |;
//		            |
//		            |////////////////////////////////////////////////////////////////////////////////
//		            |ВЫБРАТЬ
//		            |	ВТДоставки.ИнтернетМагазин,
//		            |	ВТДоставки.Реализация,
//		            |	ВТДоставки.НомерЗаказа КАК НомерЗаказаНаш,
//		            |	ВТДоставки.НомерВнешнегоЗаказа КАК НомерЗаказа,
//		            |	НАЧАЛОПЕРИОДА(ВТДоставки.ДатаДоставки, ДЕНЬ) КАК ДатаДоставки,
//		            |	ВТДоставки.ВидРабот,
//		            |	ВТДоставки.ДатаЗабора,
//		            |	ВТДоставки.СтоимостьГруза,
//		            |	ВТДоставки.СтоимостьВозврата,
//		            |	ВТДоставки.АгентскоеВознаграждение,
//		            |	ВТДоставки.СуммаПолученнаяОтПокупателей КАК Сумма,
//		            |	ВТДоставки.СтоимостьДоставки,
//		            |	ВТДоставки.СтатусДоставки,
//		            |	ВТОплаты.Дата КАК ДатаПлатежа,
//		            |	ВТОплаты.СуммаДокумента,
//		            |	ВТОплаты.НомерПП
//		            |ИЗ
//		            |	ВТОплаты КАК ВТОплаты
//		            |		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоставки КАК ВТДоставки
//		            |		ПО (ВТДоставки.ГодДоставки = ВТОплаты.ГодДоставки)
//		            |			И (ВТДоставки.МесяцДоставки = ВТОплаты.МесяцДоставки)
//		            |			И (ВТДоставки.ДеньДоставки = ВТОплаты.ДеньДоставки)
//		            |
//		            |УПОРЯДОЧИТЬ ПО
//		            |	ВТДоставки.НомерВнешнегоЗаказа
//		            |;
//		            |
//		            |////////////////////////////////////////////////////////////////////////////////
//		            |УНИЧТОЖИТЬ ВТОплаты
//		            |;
//		            |
//		            |////////////////////////////////////////////////////////////////////////////////
//		            |УНИЧТОЖИТЬ ВТДоставки";


		Зап.Текст = "ВЫБРАТЬ
		            |	МИНИМУМ(ПлатежноеПоручениеИсходящееТаблицаДатОплат.Ссылка.Дата) КАК Дата,
		            |	ГОД(ПлатежноеПоручениеИсходящееТаблицаДатОплат.ДатаДоставки) КАК ГодДоставки,
		            |	МЕСЯЦ(ПлатежноеПоручениеИсходящееТаблицаДатОплат.ДатаДоставки) КАК МесяцДоставки,
		            |	ДЕНЬ(ПлатежноеПоручениеИсходящееТаблицаДатОплат.ДатаДоставки) КАК ДеньДоставки,
		            |	ПлатежноеПоручениеИсходящееТаблицаДатОплат.Ссылка.СуммаДокумента,
		            |	ПлатежноеПоручениеИсходящееТаблицаДатОплат.Ссылка.НомерПлатежногоПоручения КАК НомерПП
		            |ПОМЕСТИТЬ ВТОплаты
		            |ИЗ
		            |	Документ.ПлатежноеПоручениеИсходящее.ТаблицаДатОплат КАК ПлатежноеПоручениеИсходящееТаблицаДатОплат
		            |ГДЕ
		            |	ПлатежноеПоручениеИсходящееТаблицаДатОплат.Ссылка.Проведен = ИСТИНА"
					+?(ПоГруппеКомпаний,"	И ПлатежноеПоручениеИсходящееТаблицаДатОплат.Ссылка.Контрагент В (&СписокКонтрагентов)",
							"	И ПлатежноеПоручениеИсходящееТаблицаДатОплат.Ссылка.Контрагент = &Контрагент")+"
							
		            |	И ПлатежноеПоручениеИсходящееТаблицаДатОплат.Ссылка.Дата МЕЖДУ &НачПериода И &КонПериода
		            |
		            |СГРУППИРОВАТЬ ПО
		            |	ГОД(ПлатежноеПоручениеИсходящееТаблицаДатОплат.ДатаДоставки),
		            |	МЕСЯЦ(ПлатежноеПоручениеИсходящееТаблицаДатОплат.ДатаДоставки),
		            |	ДЕНЬ(ПлатежноеПоручениеИсходящееТаблицаДатОплат.ДатаДоставки),
		            |	ПлатежноеПоручениеИсходящееТаблицаДатОплат.Ссылка.СуммаДокумента,
		            |	ПлатежноеПоручениеИсходящееТаблицаДатОплат.Ссылка.НомерПлатежногоПоручения
		            |;
		            |
		            |////////////////////////////////////////////////////////////////////////////////
		            |ВЫБРАТЬ
		            |	ЗакрытыеЗаказы.ИнтернетМагазин,
		            |	ЗакрытыеЗаказы.Реализация,
		            |	ЗакрытыеЗаказы.Реализация.Номер КАК НомерЗаказа,
		            |	ЗакрытыеЗаказы.Реализация.НомерВнешнегоЗаказа КАК НомерВнешнегоЗаказа,
		            |	ЗакрытыеЗаказы.Период КАК ДатаДоставки,
		            |	ЗакрытыеЗаказы.ТипЗаказа КАК ВидРабот,
		            |	ЗакрытыеЗаказы.Доставка.ДатаСоздания КАК ДатаЗабора,
		            |	ЗакрытыеЗаказыОбороты.СуммаОценочнаяОборот КАК СтоимостьГруза,
		            |	ЗакрытыеЗаказы.ПричинаНевыполнения КАК ПричинаНевыполнения,
		            |	ЗакрытыеЗаказыОбороты.СуммаЧастичногоВозвратаОборот КАК СтоимостьВозврата,
		            |	ЗакрытыеЗаказыОбороты.УслугиСДОборот + ЗакрытыеЗаказыОбороты.БанковскаяКомиссияОборот + ЗакрытыеЗаказыОбороты.КассовоеОбслуживаниеОборот КАК АгентскоеВознаграждение,
		            |	ВЫБОР
		            |		КОГДА ЗакрытыеЗаказыОбороты.ТипОплаты В (&МассивТиповОплат)
		            |			ТОГДА ЗакрытыеЗаказыОбороты.ОплаченоКлиентовНалОборот
		            |		ИНАЧЕ 0
		            |	КОНЕЦ КАК СуммаПолученнаяОтПокупателей,
		            |	ЗакрытыеЗаказыОбороты.СуммаДоставкиДоМКАДОборот + ЗакрытыеЗаказыОбороты.СуммаДоставкиЗаМКАДОборот КАК СтоимостьДоставки,
		            |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаПеречисления,
		            |	ЗакрытыеЗаказы.СтатусЗаказа КАК СтатусДоставки,
		            |	ГОД(ЗакрытыеЗаказы.Период) КАК ГодДоставки,
		            |	МЕСЯЦ(ЗакрытыеЗаказы.Период) КАК МесяцДоставки,
		            |	ДЕНЬ(ЗакрытыеЗаказы.Период) КАК ДеньДоставки,
					|   ЗакрытыеЗаказыОбороты.СтраховойСборОборот КАК СтраховойСбор
		            |ПОМЕСТИТЬ ВТДоставки
		            |ИЗ
		            |	РегистрНакопления.ЗакрытыеЗаказы КАК ЗакрытыеЗаказы
		            |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗакрытыеЗаказы.Обороты КАК ЗакрытыеЗаказыОбороты
		            |		ПО ЗакрытыеЗаказы.Реализация = ЗакрытыеЗаказыОбороты.Реализация
		            |ГДЕ"
					//+++ Костя 030915
		+?(ПоГруппеКомпаний,"	ЗакрытыеЗаказы.ИнтернетМагазин В ИЕРАРХИИ(&СписокКонтрагентов)",
							"	ЗакрытыеЗаказы.ИнтернетМагазин = &Контрагент")+"
							//--- Костя 030915
		            |	И ЗакрытыеЗаказы.СтатусИнтернетМагазина <> ЗНАЧЕНИЕ(Справочник.СтатусЗаказаИнтернетМагазина.ЗаказОтклонен)
		            |
		            |СГРУППИРОВАТЬ ПО
		            |	ЗакрытыеЗаказы.Доставка.ДатаСоздания,
		            |	ЗакрытыеЗаказы.Реализация,
		            |	ЗакрытыеЗаказы.ИнтернетМагазин,
		            |	ЗакрытыеЗаказы.ПричинаНевыполнения,
		            |	ЗакрытыеЗаказы.СтатусЗаказа,
		            |	ЗакрытыеЗаказы.ТипЗаказа,
		            |	ЗакрытыеЗаказы.Период,
		            |	ЗакрытыеЗаказы.Реализация.Номер,
		            |	ЗакрытыеЗаказы.Реализация.НомерВнешнегоЗаказа,
		            |	ДЕНЬ(ЗакрытыеЗаказы.Период),
		            |	МЕСЯЦ(ЗакрытыеЗаказы.Период),
		            |	ГОД(ЗакрытыеЗаказы.Период),
		            |	ЗакрытыеЗаказыОбороты.СуммаОценочнаяОборот,
		            |	ЗакрытыеЗаказыОбороты.СуммаЧастичногоВозвратаОборот,
		            |	ЗакрытыеЗаказыОбороты.СуммаДоставкиДоМКАДОборот + ЗакрытыеЗаказыОбороты.СуммаДоставкиЗаМКАДОборот,
		            |	ВЫБОР
		            |		КОГДА ЗакрытыеЗаказыОбороты.ТипОплаты В (&МассивТиповОплат)
		            |			ТОГДА ЗакрытыеЗаказыОбороты.ОплаченоКлиентовНалОборот
		            |		ИНАЧЕ 0
		            |	КОНЕЦ,
		            |	ЗакрытыеЗаказыОбороты.УслугиСДОборот + ЗакрытыеЗаказыОбороты.БанковскаяКомиссияОборот + ЗакрытыеЗаказыОбороты.КассовоеОбслуживаниеОборот?
					|   ЗакрытыеЗаказыОбороты.СтраховойСборОборот
		            |;
		            |
		            |////////////////////////////////////////////////////////////////////////////////
		            |ВЫБРАТЬ
		            |	ВТДоставки.ИнтернетМагазин,
		            |	ВТДоставки.Реализация,
		            |	ВТДоставки.НомерЗаказа КАК НомерЗаказаНаш,
		            |	ВТДоставки.НомерВнешнегоЗаказа КАК НомерЗаказа,
		            |	НАЧАЛОПЕРИОДА(ВТДоставки.ДатаДоставки, ДЕНЬ) КАК ДатаДоставки,
		            |	ВТДоставки.ВидРабот,
		            |	ВТДоставки.ДатаЗабора,
		            |	ВТДоставки.СтоимостьГруза,
		            |	ВТДоставки.СтоимостьВозврата,
		            |	ВТДоставки.АгентскоеВознаграждение,
		            |	ВТДоставки.СуммаПолученнаяОтПокупателей КАК Сумма,
		            |	ВТДоставки.СтоимостьДоставки,
		            |	ВТДоставки.СтатусДоставки,
		            |	ВТОплаты.Дата КАК ДатаПлатежа,
		            |	ВТОплаты.СуммаДокумента,
		            |	ВТОплаты.НомерПП,
					|   ВТДоставки.СтраховойСбор
		            |ИЗ
		            |	ВТОплаты КАК ВТОплаты
		            |		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоставки КАК ВТДоставки
		            |		ПО (ВТДоставки.ГодДоставки = ВТОплаты.ГодДоставки)
		            |			И (ВТДоставки.МесяцДоставки = ВТОплаты.МесяцДоставки)
		            |			И (ВТДоставки.ДеньДоставки = ВТОплаты.ДеньДоставки)
		            |
		            |УПОРЯДОЧИТЬ ПО
		            |	ВТДоставки.НомерВнешнегоЗаказа
		            |;
		            |
		            |////////////////////////////////////////////////////////////////////////////////
		            |УНИЧТОЖИТЬ ВТОплаты
		            |;
		            |
		            |////////////////////////////////////////////////////////////////////////////////
		            |УНИЧТОЖИТЬ ВТДоставки";


	Иначе
//		Зап.Текст = "ВЫБРАТЬ
//		            |	&ДатаПлатежа КАК Дата,
//		            |	ГОД(ПлатежноеПоручениеИсходящееТаблицаДатОплат.ДатаДоставки) КАК ГодДоставки,
//		            |	МЕСЯЦ(ПлатежноеПоручениеИсходящееТаблицаДатОплат.ДатаДоставки) КАК МесяцДоставки,
//		            |	ДЕНЬ(ПлатежноеПоручениеИсходящееТаблицаДатОплат.ДатаДоставки) КАК ДеньДоставки,
//		            |	ПлатежноеПоручениеИсходящееТаблицаДатОплат.НомерПП КАК НомерПП
//		            |ПОМЕСТИТЬ ВТОплаты
//		            |ИЗ
//		            |	&Мас КАК ПлатежноеПоручениеИсходящееТаблицаДатОплат
//		            |;
//		            |
//		            |////////////////////////////////////////////////////////////////////////////////
//		            |ВЫБРАТЬ
//		            |	ЗакрытыеЗаказы.ИнтернетМагазин,
//		            |	ЗакрытыеЗаказы.Реализация,
//		            |	ЗакрытыеЗаказы.Реализация.Номер КАК НомерЗаказа,
//		            |	ЗакрытыеЗаказы.Реализация.НомерВнешнегоЗаказа КАК НомерВнешнегоЗаказа,
//		            |	ЗакрытыеЗаказы.Период КАК ДатаДоставки,
//		            |	ЗакрытыеЗаказы.ТипЗаказа КАК ВидРабот,
//		            |	ЗакрытыеЗаказы.Доставка.ДатаСоздания КАК ДатаЗабора,
//		            |	ЗакрытыеЗаказы.СуммаОценочная КАК СтоимостьГруза,
//					|	ЗакрытыеЗаказы.ПричинаНевыполнения КАК ПричинаНевыполнения,
//					|	ЗакрытыеЗаказы.ТипОплаты КАК ТипОплаты,
//		            |	ЗакрытыеЗаказы.СуммаЧастичногоВозврата КАК СтоимостьВозврата,
//		            |	ЗакрытыеЗаказы.УслугиСД + ЗакрытыеЗаказы.БанковскаяКомиссия + ЗакрытыеЗаказы.КассовоеОбслуживание КАК АгентскоеВознаграждение,
//		            |	ВЫБОР
//		            |		КОГДА ЗакрытыеЗаказы.ТипОплаты В (&МассивТиповОплат)
//		            |			ТОГДА ЗакрытыеЗаказы.ОплаченоКлиентовНал
//		            |		ИНАЧЕ 0
//		            |	КОНЕЦ КАК СуммаПолученнаяОтПокупателей,
//		            |	ЗакрытыеЗаказы.СуммаДоставкиДоМКАД + ЗакрытыеЗаказы.СуммаДоставкиЗаМКАД КАК СтоимостьДоставки,
//		            |	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаПеречисления,
//		            |	ЗакрытыеЗаказы.СтатусЗаказа КАК СтатусДоставки,
//		            |	ГОД(ЗакрытыеЗаказы.Период) КАК ГодДоставки,
//		            |	МЕСЯЦ(ЗакрытыеЗаказы.Период) КАК МесяцДоставки,
//		            |	ДЕНЬ(ЗакрытыеЗаказы.Период) КАК ДеньДоставки,
//                    |   ЗакрытыеЗаказы.СтраховойСбор
//		            |ПОМЕСТИТЬ ВТДоставки
//		            |ИЗ
//		            |	РегистрНакопления.ЗакрытыеЗаказы КАК ЗакрытыеЗаказы
//		            |ГДЕ" 
//					//+++ Костя 030915
//+?(ПоГруппеКомпаний,"	ЗакрытыеЗаказы.ИнтернетМагазин В ИЕРАРХИИ(&СписокКонтрагентов)",
//					"	ЗакрытыеЗаказы.ИнтернетМагазин = &Контрагент")+"
//					//--- Костя 030915
//		            |	И ЗакрытыеЗаказы.СтатусИнтернетМагазина <> ЗНАЧЕНИЕ(Справочник.СтатусЗаказаИнтернетМагазина.ЗаказОтклонен)
//		            |;
//		            |
//		            |////////////////////////////////////////////////////////////////////////////////
//		            |ВЫБРАТЬ
//		            |	ВТДоставки.ИнтернетМагазин,
//		            |	ВТДоставки.Реализация,
//		            |	ВТДоставки.НомерЗаказа КАК НомерЗаказаНаш,
//		            |	ВТДоставки.НомерВнешнегоЗаказа КАК НомерЗаказа,
//		            |	НАЧАЛОПЕРИОДА(ВТДоставки.ДатаДоставки, ДЕНЬ) КАК ДатаДоставки,
//		            |	ВТДоставки.ВидРабот,
//		            |	ВТДоставки.ДатаЗабора,
//		            |	ВТДоставки.СтоимостьГруза,
//					|	ВТДоставки.ПричинаНевыполнения КАК ПричинаНевыполнения,
//					|	ВТДоставки.ТипОплаты КАК ТипОплаты,
//		            |	ВТДоставки.СтоимостьВозврата,
//		            |	ВТДоставки.АгентскоеВознаграждение,
//		            |	ВТДоставки.СуммаПолученнаяОтПокупателей КАК Сумма,
//		            |	ВТДоставки.СтоимостьДоставки,
//		            |	ВТДоставки.СтатусДоставки,
//		            |	ВТОплаты.Дата КАК ДатаПлатежа,
//		            |	ВТОплаты.НомерПП,
//	                |   ВТДоставки.СтраховойСбор
//		            |ИЗ
//		            |	ВТОплаты КАК ВТОплаты
//		            |		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоставки КАК ВТДоставки
//		            |		ПО (ВТДоставки.ГодДоставки = ВТОплаты.ГодДоставки)
//		            |			И (ВТДоставки.МесяцДоставки = ВТОплаты.МесяцДоставки)
//		            |			И (ВТДоставки.ДеньДоставки = ВТОплаты.ДеньДоставки)
//		            |
//		            |УПОРЯДОЧИТЬ ПО
//		            |	ВТДоставки.НомерВнешнегоЗаказа
//		            |;
//		            |
//		            |////////////////////////////////////////////////////////////////////////////////
//		            |УНИЧТОЖИТЬ ВТОплаты
//		            |;
//		            |
//		            |////////////////////////////////////////////////////////////////////////////////
//		            |УНИЧТОЖИТЬ ВТДоставки";


		Зап.Текст = "ВЫБРАТЬ
		            |	&ДатаПлатежа КАК Дата,
		            |	ГОД(ПлатежноеПоручениеИсходящееТаблицаДатОплат.ДатаДоставки) КАК ГодДоставки,
		            |	МЕСЯЦ(ПлатежноеПоручениеИсходящееТаблицаДатОплат.ДатаДоставки) КАК МесяцДоставки,
		            |	ДЕНЬ(ПлатежноеПоручениеИсходящееТаблицаДатОплат.ДатаДоставки) КАК ДеньДоставки,
		            |	ПлатежноеПоручениеИсходящееТаблицаДатОплат.НомерПП КАК НомерПП
		            |ПОМЕСТИТЬ ВТОплаты
		            |ИЗ
		            |	&Мас КАК ПлатежноеПоручениеИсходящееТаблицаДатОплат
		            |;
		            |
		            |////////////////////////////////////////////////////////////////////////////////
		            |ВЫБРАТЬ
		            |	ЗакрытыеЗаказы.ИнтернетМагазин,
		            |	ЗакрытыеЗаказы.Реализация,
		            |	ЗакрытыеЗаказы.Реализация.Номер КАК НомерЗаказа,
		            |	ЗакрытыеЗаказы.Реализация.НомерВнешнегоЗаказа КАК НомерВнешнегоЗаказа,
		            |	ЗакрытыеЗаказы.Период КАК ДатаДоставки,
		            |	ЗакрытыеЗаказы.ТипЗаказа КАК ВидРабот,
		            |	ЗакрытыеЗаказы.Доставка.ДатаСоздания КАК ДатаЗабора,
		            |	ЗакрытыеЗаказыОбороты.СуммаОценочнаяОборот КАК СтоимостьГруза,
		            |	ЗакрытыеЗаказы.ПричинаНевыполнения КАК ПричинаНевыполнения,
		            |	ЗакрытыеЗаказы.ТипОплаты КАК ТипОплаты,
		            |	ЗакрытыеЗаказыОбороты.СуммаЧастичногоВозвратаОборот КАК СтоимостьВозврата,
		            |	ЗакрытыеЗаказыОбороты.УслугиСДОборот + ЗакрытыеЗаказыОбороты.БанковскаяКомиссияОборот + ЗакрытыеЗаказыОбороты.КассовоеОбслуживаниеОборот КАК АгентскоеВознаграждение,
		            |	ВЫБОР
		            |		КОГДА ЗакрытыеЗаказы.ТипОплаты В (&МассивТиповОплат)
		            |			ТОГДА ЗакрытыеЗаказыОбороты.ОплаченоКлиентовНалОборот
		            |		ИНАЧЕ 0
		            |	КОНЕЦ КАК СуммаПолученнаяОтПокупателей,
		            |	ЗакрытыеЗаказыОбороты.СуммаДоставкиДоМКАДОборот + ЗакрытыеЗаказыОбороты.СуммаДоставкиЗаМКАДОборот КАК СтоимостьДоставки,
		            |	МАКСИМУМ(ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаПеречисления,
		            |	ЗакрытыеЗаказы.СтатусЗаказа КАК СтатусДоставки,
		            |	ГОД(ЗакрытыеЗаказы.Период) КАК ГодДоставки,
		            |	МЕСЯЦ(ЗакрытыеЗаказы.Период) КАК МесяцДоставки,
		            |	ДЕНЬ(ЗакрытыеЗаказы.Период) КАК ДеньДоставки,
		            |	ЗакрытыеЗаказыОбороты.СтраховойСборОборот КАК СтраховойСбор 
		            |ПОМЕСТИТЬ ВТДоставки
		            |ИЗ
		            |	РегистрНакопления.ЗакрытыеЗаказы КАК ЗакрытыеЗаказы
		            |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗакрытыеЗаказы.Обороты КАК ЗакрытыеЗаказыОбороты
		            |		ПО ЗакрытыеЗаказы.Реализация = ЗакрытыеЗаказыОбороты.Реализация
		            |ГДЕ" 
					+?(ПоГруппеКомпаний,"	ЗакрытыеЗаказы.ИнтернетМагазин В ИЕРАРХИИ(&СписокКонтрагентов)",
					"	ЗакрытыеЗаказы.ИнтернетМагазин = &Контрагент")+"
				    |	И ЗакрытыеЗаказы.СтатусИнтернетМагазина <> ЗНАЧЕНИЕ(Справочник.СтатусЗаказаИнтернетМагазина.ЗаказОтклонен)
					|
		            |СГРУППИРОВАТЬ ПО
		            |	ЗакрытыеЗаказы.ТипЗаказа,
		            |	ЗакрытыеЗаказы.ТипОплаты,
		            |	ЗакрытыеЗаказы.Период,
		            |	ЗакрытыеЗаказы.Реализация,
		            |	ЗакрытыеЗаказы.СтатусЗаказа,
		            |	ЗакрытыеЗаказы.Доставка.ДатаСоздания,
		            |	ЗакрытыеЗаказы.ПричинаНевыполнения,
		            |	ЗакрытыеЗаказы.ИнтернетМагазин,
		            |	ЗакрытыеЗаказы.Реализация.Номер,
		            |	ЗакрытыеЗаказы.Реализация.НомерВнешнегоЗаказа,
		            |	ЗакрытыеЗаказыОбороты.СуммаОценочнаяОборот,
		            |	ЗакрытыеЗаказыОбороты.СуммаЧастичногоВозвратаОборот,
		            |	ЗакрытыеЗаказыОбороты.УслугиСДОборот + ЗакрытыеЗаказыОбороты.БанковскаяКомиссияОборот + ЗакрытыеЗаказыОбороты.КассовоеОбслуживаниеОборот,
		            |	ВЫБОР
		            |		КОГДА ЗакрытыеЗаказы.ТипОплаты В (&МассивТиповОплат)
		            |			ТОГДА ЗакрытыеЗаказыОбороты.ОплаченоКлиентовНалОборот
		            |		ИНАЧЕ 0
		            |	КОНЕЦ,
		            |	ЗакрытыеЗаказыОбороты.СуммаДоставкиДоМКАДОборот + ЗакрытыеЗаказыОбороты.СуммаДоставкиЗаМКАДОборот,
		            |	ГОД(ЗакрытыеЗаказы.Период),
		            |	МЕСЯЦ(ЗакрытыеЗаказы.Период),
		            |	ДЕНЬ(ЗакрытыеЗаказы.Период),
		            |	ЗакрытыеЗаказыОбороты.СтраховойСборОборот
		            |;
		            |
		            |////////////////////////////////////////////////////////////////////////////////
		            |ВЫБРАТЬ
		            |	ВТДоставки.ИнтернетМагазин,
		            |	ВТДоставки.Реализация,
		            |	ВТДоставки.НомерЗаказа КАК НомерЗаказаНаш,
		            |	ВТДоставки.НомерВнешнегоЗаказа КАК НомерЗаказа,
		            |	НАЧАЛОПЕРИОДА(ВТДоставки.ДатаДоставки, ДЕНЬ) КАК ДатаДоставки,
		            |	ВТДоставки.ВидРабот,
		            |	ВТДоставки.ДатаЗабора,
		            |	ВТДоставки.СтоимостьГруза,
		            |	ВТДоставки.ПричинаНевыполнения КАК ПричинаНевыполнения,
		            |	ВТДоставки.ТипОплаты КАК ТипОплаты,
		            |	ВТДоставки.СтоимостьВозврата,
		            |	ВТДоставки.АгентскоеВознаграждение,
		            |	ВТДоставки.СуммаПолученнаяОтПокупателей КАК Сумма,
		            |	ВТДоставки.СтоимостьДоставки,
		            |	ВТДоставки.СтатусДоставки,
		            |	ВТОплаты.Дата КАК ДатаПлатежа,
		            |	ВТОплаты.НомерПП,
					|	ВТДоставки.СтраховойСбор
		            |ИЗ
		            |	ВТОплаты КАК ВТОплаты
		            |		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоставки КАК ВТДоставки
		            |		ПО (ВТДоставки.ГодДоставки = ВТОплаты.ГодДоставки)
		            |			И (ВТДоставки.МесяцДоставки = ВТОплаты.МесяцДоставки)
		            |			И (ВТДоставки.ДеньДоставки = ВТОплаты.ДеньДоставки)
		            |
		            |УПОРЯДОЧИТЬ ПО
		            |	ВТДоставки.НомерВнешнегоЗаказа
		            |;
		            |
		            |////////////////////////////////////////////////////////////////////////////////
		            |УНИЧТОЖИТЬ ВТОплаты
		            |;
		            |
		            |////////////////////////////////////////////////////////////////////////////////
		            |УНИЧТОЖИТЬ ВТДоставки";
					
					
		Зап.УстановитьПараметр("Мас", ТаблицаДат);			
		Зап.УстановитьПараметр("ДатаПлатежа", ДатаПлатежа);
	КонецеСли;			
	Зап.УстановитьПараметр("НачПериода", НачалоДня(НачПериода));			
	Зап.УстановитьПараметр("КонПериода", КонецДня(КонПериода));
	Зап.УстановитьПараметр("Контрагент", Контрагент);
	//+++ Костя 030915
	Зап.УстановитьПараметр("СписокКонтрагентов", СписокКонтрагентов);
	//--- Костя 030915
	Зап.УстановитьПараметр("МассивТиповОплат", МассивТиповОплат);
	Зап.УстановитьПараметр("Доставка", Перечисления.ТипыЗаказов.Доставка);
    
	Рез = Зап.Выполнить().Выгрузить();
	
	
	ИтСум = 0;	
	Если Не Приложение6 Тогда
		Мак = ПолучитьМакет("Макет");
		ОблШ = Мак.ПолучитьОбласть("Шапка");
		ОблСтр = Мак.ПолучитьОбласть("Строка");
		СумДок = 0;
		ВывелиШапку = Ложь;
		Для Каждого Тек Из Рез Цикл
			//Если Не ЗначениеЗаполнено(Тек.Сумма) Тогда
			//	Продолжить;
			//КонецеСли;
			Если Тек.Сумма = NULL ИЛИ НЕ ЗначениеЗаполнено(Тек.Сумма) Тогда
				Продолжить;
			КонецеСли;
			Если ТаблицаДат = Неопределено Тогда
				Если Сумдок = 0 Тогда
					СумДок = Тек.СуммаДокумента;
					
					ОблШ.Параметры.ДатаПеревода = Тек.ДатаПлатежа;
					ДатаПлатежа = Тек.ДатаПлатежа;
					//+++ Костя -- По ТипОплатыКомитентам
					Если Тек.ИнтернетМагазин.ТипОплатыКомитентам = Перечисления.ВариантОплатыКомитентам.ПустаяСсылка() 
						Или Тек.ИнтернетМагазин.ТипОплатыКомитентам = Перечисления.ВариантОплатыКомитентам.СуммаПолностью Тогда
						// СуммаПолностью	
						ОблШ.Параметры.Сумма = Рез.Итог("Сумма");						
					Иначе // Без наших услуг
						ОблШ.Параметры.Сумма = Рез.Итог("Сумма") - Рез.Итог("АгентскоеВознаграждение");//Рез.Итог("Сумма");	
					КонецЕсли;
					//+++ Костя
					
					//ОблШ.Параметры.Сумма = Рез.Итог("Сумма");
					
					Таб.Вывести(ОблШ);
				КонецеСли;	
			Иначе
				Если Не ВывелиШапку Тогда
					ОблШ.Параметры.ДатаПеревода = ДатаПлатежа;
					//+++ Костя -- По ТипОплатыКомитентам
					Если Тек.ИнтернетМагазин.ТипОплатыКомитентам = Перечисления.ВариантОплатыКомитентам.ПустаяСсылка() 
						Или Тек.ИнтернетМагазин.ТипОплатыКомитентам = Перечисления.ВариантОплатыКомитентам.СуммаПолностью Тогда
						// СуммаПолностью	
						ОблШ.Параметры.Сумма = Рез.Итог("Сумма");						
					Иначе // Без наших услуг
						ОблШ.Параметры.Сумма = Рез.Итог("Сумма") - Рез.Итог("АгентскоеВознаграждение");//Рез.Итог("Сумма");	
					КонецЕсли;
					//+++ Костя
					
					//ОблШ.Параметры.Сумма = Рез.Итог("Сумма");
					Таб.Вывести(ОблШ);
					ВывелиШапку = Истина;
				КонецеСли;
			КонецЕсли;
			//+++ Костя -- По ТипОплатыКомитентам
			Если Тек.ИнтернетМагазин.ТипОплатыКомитентам = Перечисления.ВариантОплатыКомитентам.ПустаяСсылка() 
				Или Тек.ИнтернетМагазин.ТипОплатыКомитентам = Перечисления.ВариантОплатыКомитентам.СуммаПолностью Тогда
				// СуммаПолностью	
			Иначе // Без наших услуг
				Тек.Сумма = Тек.Сумма - Тек.АгентскоеВознаграждение;// - Тек.СтоимостьДоставки;
			КонецЕсли;
			//+++ Костя
			ЗаполнитьЗначенияСвойств(ОблСтр.параметры, Тек);
			Таб.Вывести(ОблСтр);
		КонецЦикла;
		
		Разница = СумДок - Рез.Итог("Сумма");
		Таб.ИмяПараметровПечати = "РасшифровкабанковскихПереводов003";
	Иначе
		//Мак = ПолучитьМакет("Приложение_6");
		
		Мак = ПолучитьМакет("Приложение_6_2015");
		ОблШ = Мак.ПолучитьОбласть("Шапка");
		ОблСтр = Мак.ПолучитьОбласть("Строка");
		ОблПод = Мак.ПолучитьОбласть("Подвал");
		СумДок = 0;
		ВывелиШапку = Ложь;
		
		Таб.Вывести(ОблШ);
		НПП	= 1;
		ИтСум = 0;	
		Для Каждого Тек Из Рез Цикл
			//Если Не ЗначениеЗаполнено(Тек.Сумма) Тогда
			//	Продолжить;
			//КонецеСли;
			Если Тек.Сумма = NULL Тогда//ИЛИ НЕ ЗначениеЗаполнено(Тек.Сумма) Тогда
				Продолжить;
			КонецеСли;			
			
			Если Тек.ИнтернетМагазин.ТипОплатыКомитентам = Перечисления.ВариантОплатыКомитентам.ПустаяСсылка() 
				Или Тек.ИнтернетМагазин.ТипОплатыКомитентам = Перечисления.ВариантОплатыКомитентам.СуммаПолностью Тогда
				Тек.Сумма = Тек.Сумма;
				                  
				Если ТипЗнч(Тек.Реализация) = Тип("ДокументСсылка.РеализацияТоваровУслуг") ИЛИ  ТипЗнч(Тек.Реализация) = Тип("ДокументСсылка.Фрахт") Тогда
					Если Тек.Реализация.ТипОплаты = 7 ИЛИ Тек.Реализация.ТипОплаты = 4 Тогда Продолжить; КонецЕсли;
				КонецЕсли;
				  // Без наших услуг
			Иначе 
				// С услугами -  - -  ->
				//Если ТЕк.СтатусДоставки = Справочники.новаРезультатМестнойДоставки.ВыполненаЧастично = 0 Тогда
				//		//И  Тек.ПричинаНевыполнения = Справочники.ПричиныНеВыполненияДоставки.ПустаяСсылка() Тогда //
				//		//Тек.СтоимостьВозврата = 0;
				//		Тек.Сумма = Тек.СтоимостьГруза;//
				//КонецЕсли;
				Если ТЕк.СтатусДоставки = Справочники.новаРезультатМестнойДоставки.НеВыполнена 
					И Тек.ПричинаНевыполнения <> Справочники.ПричиныНеВыполненияДоставки.ПустаяСсылка() Тогда
					Тек.СтоимостьВозврата = 0;
				КонецЕсли;
								
				Если ТЕк.СтатусДоставки = Справочники.новаРезультатМестнойДоставки.Выполнена  
						И  Тек.ПричинаНевыполнения = Справочники.ПричиныНеВыполненияДоставки.ПустаяСсылка() 
						И Тек.Сумма = 0 И (Тек.ТипОплаты <> Справочники.ТипыОплат.ОплаченоВМагазине И Тек.ТипОплаты <> Справочники.ТипыОплат.БезРасчетов) Тогда // Задача № 2901
						Тек.Сумма = Тек.СтоимостьГруза;
				КонецЕсли;
				
				Если Тек.Сумма = Тек.СтоимостьВозврата И Тек.Сумма <> 0 Тогда
					Тек.Сумма = Тек.Сумма -Тек.АгентскоеВознаграждение-Тек.СтраховойСбор;
				Иначе
					Если ТЕк.СтатусДоставки = Справочники.новаРезультатМестнойДоставки.ВыполненаЧастично Тогда
						Тек.Сумма = Тек.Сумма -Тек.АгентскоеВознаграждение-Тек.СтраховойСбор;
					Иначе
						Тек.Сумма = Тек.Сумма - Тек.АгентскоеВознаграждение-Тек.СтраховойСбор + ?(Тек.СтоимостьВозврата < 0,Тек.СтоимостьВозврата,-Тек.СтоимостьВозврата);// - Тек.СтоимостьДоставки;
					КонецЕсли;
				КонецЕсли;
			
			КонецЕсли;
			Если Тек.Сумма = 0 Тогда Продолжить; КонецЕсли;
			//+++ Костя			
			ЗаполнитьЗначенияСвойств(ОблСтр.параметры, Тек);
			ОблСтр.параметры.НПП = НПП;			
			ОблСтр.параметры.НомерЗаказаНаш = СокрЛП(ОблСтр.параметры.НомерЗаказаНаш);
			Таб.Вывести(ОблСтр);
			НПП = НПП + 1;
			
			ИтСум = ИтСум + Тек.Сумма;
			
		КонецЦикла;
		//ОблПод.Параметры.ИтСум = Рез.Итог("Сумма");
		ОблПод.Параметры.ИтСум = ИтСум;	
		Таб.Вывести(ОблПод);
		
		Разница = 0;
		Таб.ИмяПараметровПечати = "РасшифровкабанковскихПереводов003__";
	КонецеСли;
	
	Таб.ПолеСлева = 3;
	Таб.ПолеСнизу = 3;
	Таб.ПолеСверху = 3;
	Таб.ПолеСправа = 3;
	Таб.Автомасштаб = Истина;
	Таб.ТолькоПросмотр = 1;
	Возврат Таб;
КонецФункции
